#+TITLE: Configuration Samples
#+PROPERTY: header-args :mkdirp yes

Config file sample.

* Table of Contents
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#system-settings][System Settings]]
:END:


*/tmp/test.conf*

#+begin_src conf :tangle /tmp/test.conf :noweb yes

hello world
       
#+end_src


*bash hello world*

#+name: hello-world-prefix
#+begin_src sh :exports none
  echo "/-----------------------------------------------------------\\"
#+end_src

#+RESULTS: hello-world-prefix
: /-----------------------------------------------------------\

#+name: hello-world-postfix
#+begin_src sh :exports none
  echo "\-----------------------------------------------------------/"
#+end_src

#+RESULTS: hello-world-postfix
: \-----------------------------------------------------------/


#+name: hello-world
#+begin_src sh :tangle hello.sh :exports none :noweb yes
  <<hello-world-prefix>>
  echo "|                       hello world                         |"
  <<hello-world-postfix>>
#+end_src

#+RESULTS: hello-world
| /-----------------------------------------------------------\ |   |       |       |   |
|                                                               |   | hello | world |   |
| \-----------------------------------------------------------/ |   |       |       |   |
